# AlignmentStationLabelIncludeStation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AlignmentStationLabelIncludeStation Property
ParameterTypeId Class See Also
---
"Include Station"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AlignmentStationLabelIncludeStation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlignmentStationLabelIncludeStation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AlignmentStationLabelIncludeStation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace